# Телефоны пользователя

## Запрос на получение списка всех телефонов пользователя

Получить список всех телефонов пользователя можно, выполнив запрос:

`GET <%= config[:host] %>/phones`

```shell
curl "<%= config[:host] %>/phones" \
  -H "Authorization: Token token=#{TOKEN}"
```

> Ответ будет содержать следующие данные:

```json
{
  "phones": [
    {
      "id": 14959,
      "code": "920",
      "number": "1111111",
      "human_number": "+7 (920) 111-11-11"
    },
    {
      "id": 14960,
      "code": "920",
      "number": "2222222",
      "human_number": "+7 (920) 222-22-22"
    },
  ],
  "meta": {
    "current_page": 1,
    "next_page": null,
    "total_pages": 1,
    "per_page": 10,
    "total_count": 2
  }
}
```

## Запрос на получение телефона по номеру

```shell
curl "<%= config[:host] %>/phones/14959" \
  -H "Authorization: Token token=#{TOKEN}"
```

> В случае если данные были указаны верно, сервер вернет ответ:

```json
{
  "phone": {
    "id": 14959,
    "code": "920",
    "number": "2222222",
    "human_number": "+7 (920) 222-22-22"
  }
}
```

Получить телефон можно, выполнив запрос:
`GET <%= config[:host] %>/phones/#{ID}`

### Параметры запроса

Параметр | Обязательный | Описание
--------- | ------- | -----------
ID | Да | ID телефона

## Запрос на создание нового телефона пользователя

```shell
curl "<%= config[:host] %>/phones" \
  -H "Authorization: Token token=#{TOKEN}"
  -X POST \
  -d "phone[value]=9201111111"
```

> Ответ будет содержать следующие данные:

```json
{
  "phone": {
    "id": 14959,
    "code": "920",
    "number": "1111111",
    "human_number": "+7 (920) 111-11-11"
  }
}
```

Создать новый телефон пользователя можно, выполнив запрос:

`POST <%= config[:host] %>/phones`

Параметр | Обязательный | Описание
--------- | ------- | -----------
phone[value] | Да | Номер телефона

## Запрос на обновление телефона пользователя

```shell
curl "<%= config[:host] %>/phones/14959" \
  -H "Authorization: Token token=#{TOKEN}" \
  -X PUT \
  -d "phone[value]=9202222222"
```

> В случае если данные были указаны верно, сервер вернет ответ:

```json
{
  "phone": {
    "id": 14959,
    "code": "920",
    "number": "2222222",
    "human_number": "+7 (920) 222-22-22"
  }
}
```

Изменить телефон пользователя можно, выполнив запрос:

`PUT <%= config[:host] %>/phones/#{ID}`

Параметр | Обязательный | Описание
--------- | ------- | -----------
ID | Да | ID телефона
phone[value] | Да | Номер телефона

## Запрос на удаление телефона пользователя

```shell
curl "<%= config[:host] %>/phones/14959" \
  -H "Authorization: Token token=#{TOKEN}" \
  -X DELETE
```

> В случае успешного удаления сервер вернет пустой ответ с кодом 200

Удалить телефон пользователя можно, выполнив запрос:

`DELETE <%= config[:host] %>/phones/#{ID}`

Параметр | Обязательный | Описание
--------- | ------- | -----------
ID | Да | ID телефона
